app/controllers/form_controller.rb

      if !@is_blank

        for i in 1..@number_of_choices.to_i do
          @check = Student.where(subject: params["subject_#{i}"].strip).first
          if (@check != nil)
            Student.where(subject: params["subject_#{i}"].strip).update_all(points: params["score#{i}"].to_i)
---
SELECT "students".* FROM "students" WHERE "students"."subject" = ? ORDER BY "students"."id" ASC LIMIT ?  [["subject", "abac"], ["LIMIT", 1]]
UPDATE "students" SET "points" = ? WHERE "students"."subject" = ?  [["points", 0.0], ["subject", "a"]]