app/controllers/score_table_controller.rb

DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]
SELECT "students".* FROM "students" ORDER BY "students"."id" ASC LIMIT ?  [["LIMIT", 1000]]
---
    def list
        @commit = params[:commit]
        if (@commit == "delete")
          Student.delete(params[:id_edit])
        end
        @data = []
        @sumScore = 0
        @maxScore = -1
        @maxScoreSubject = ""
        Student.find_each do |eachStudent|

SELECT "students".* FROM "students" WHERE "students"."id" = ? ORDER BY "students"."id" ASC LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "students" SET "subject" = ?, "points" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["subject", "start"], ["points", 123.0], ["updated_at", "2022-09-12 15:18:21.061929"], ["id", 8]]
---
      def edit
        @edit = params[:form_edit]
        if (@edit)
          @subject_update = params[:subject_update]
          @point_update = params[:point_update]
          @id_update = params[:id_update]

          @isStringEmpty = false
          if (@subject_update.strip === "" || @point_update === "")
            @isStringEmpty = true
          end

          @isUpdateSuccess = false
          if (!@isStringEmpty)
            @check = Student.where(id: @id_update).first                         #Update data
            @check.subject = @subject_update.strip
            @check.points = @point_update.to_i
            @check.save